Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK1024GPK100.PIC
      <edc:SFRDef edc:_addr="0x1F810430" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC47" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---00000" edc:name="IPC47" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN4IS" edc:desc="" edc:mask="0x3" edc:name="CAN4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN4IP" edc:desc="" edc:mask="0x7" edc:name="CAN4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="QEI3IS" edc:mask="0x3" edc:name="QEI3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI3IP" edc:mask="0x7" edc:name="QEI3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="QEI4IS" edc:mask="0x3" edc:name="QEI4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI4IP" edc:mask="0x7" edc:name="QEI4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="QEI5IS" edc:mask="0x3" edc:name="QEI5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI5IP" edc:mask="0x7" edc:name="QEI5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810440" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC48" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------uuuuu" edc:name="IPC48" edc:nzwidth="32" edc:por="---00000---00000-----------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEI6IS" edc:mask="0x3" edc:name="QEI6IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI6IP" edc:mask="0x7" edc:name="QEI6IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="I2C4BIS" edc:desc="" edc:mask="0x3" edc:name="I2C4BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIP" edc:desc="" edc:mask="0x7" edc:name="I2C4BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4SIS" edc:desc="" edc:mask="0x3" edc:name="I2C4SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4SIP" edc:desc="" edc:mask="0x7" edc:name="I2C4SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810450" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC49" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC49" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C4MIS" edc:desc="" edc:mask="0x3" edc:name="I2C4MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4MIP" edc:desc="" edc:mask="0x7" edc:name="I2C4MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC10EIS" edc:desc="" edc:mask="0x3" edc:name="IC10EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC10EIP" edc:desc="" edc:mask="0x7" edc:name="IC10EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC10IS" edc:desc="" edc:mask="0x3" edc:name="IC10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC10IP" edc:desc="" edc:mask="0x7" edc:name="IC10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC10IS" edc:desc="" edc:mask="0x3" edc:name="OC10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC10IP" edc:desc="" edc:mask="0x7" edc:name="OC10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810460" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC50" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC50" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC11EIS" edc:desc="" edc:mask="0x3" edc:name="IC11EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC11EIP" edc:desc="" edc:mask="0x7" edc:name="IC11EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC11IS" edc:desc="" edc:mask="0x3" edc:name="IC11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC11IP" edc:desc="" edc:mask="0x7" edc:name="IC11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC11IS" edc:desc="" edc:mask="0x3" edc:name="OC11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC11IP" edc:desc="" edc:mask="0x7" edc:name="OC11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC12EIS" edc:desc="" edc:mask="0x3" edc:name="IC12EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC12EIP" edc:desc="" edc:mask="0x7" edc:name="IC12EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
