Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK1024GPK100.PIC
      <edc:SFRDef edc:_addr="0x1F860410" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn--nn------nn" edc:cname="TRISE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--11------11" edc:name="TRISE" edc:nzwidth="0x20" edc:por="----------------1111--11------11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISE0" edc:desc="" edc:mask="0x1" edc:name="TRISE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE1" edc:desc="" edc:mask="0x1" edc:name="TRISE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISE8" edc:desc="" edc:mask="0x1" edc:name="TRISE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE9" edc:desc="" edc:mask="0x1" edc:name="TRISE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISE12" edc:desc="" edc:mask="0x1" edc:name="TRISE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE13" edc:desc="" edc:mask="0x1" edc:name="TRISE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE14" edc:desc="" edc:mask="0x1" edc:name="TRISE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE15" edc:desc="" edc:mask="0x1" edc:name="TRISE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860420" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn--nn------nn" edc:cname="PORTE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xx------xx" edc:name="PORTE" edc:nzwidth="0x20" edc:por="----------------xxxx--xx------xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RE8" edc:desc="" edc:mask="0x1" edc:name="RE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE9" edc:desc="" edc:mask="0x1" edc:name="RE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RE12" edc:desc="" edc:mask="0x1" edc:name="RE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE13" edc:desc="" edc:mask="0x1" edc:name="RE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE14" edc:desc="" edc:mask="0x1" edc:name="RE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE15" edc:desc="" edc:mask="0x1" edc:name="RE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860430" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn--nn------nn" edc:cname="LATE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xx------xx" edc:name="LATE" edc:nzwidth="0x20" edc:por="----------------xxxx--xx------xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATE8" edc:desc="" edc:mask="0x1" edc:name="LATE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE9" edc:desc="" edc:mask="0x1" edc:name="LATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATE12" edc:desc="" edc:mask="0x1" edc:name="LATE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE13" edc:desc="" edc:mask="0x1" edc:name="LATE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE14" edc:desc="" edc:mask="0x1" edc:name="LATE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE15" edc:desc="" edc:mask="0x1" edc:name="LATE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
