Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK1024GPK100.PIC
      <edc:SFRDef edc:_addr="0x1F8606B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNFG" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFG0" edc:mask="0x1" edc:name="CNFG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG1" edc:mask="0x1" edc:name="CNFG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG10" edc:mask="0x1" edc:name="CNFG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG11" edc:mask="0x1" edc:name="CNFG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG12" edc:mask="0x1" edc:name="CNFG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG13" edc:mask="0x1" edc:name="CNFG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG14" edc:mask="0x1" edc:name="CNFG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG15" edc:mask="0x1" edc:name="CNFG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8606C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8606D0" edc:offset="16"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f88B000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="0x7000"/>
      <edc:SFRDef edc:_addr="0x1F887000" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="nrnnnnnnnnnnnnnnn-nnnnn--nnnnnnn" edc:cname="ADCCON1" edc:desc="" edc:impl="0xffffbe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000110000000000-00000--0000uuu" edc:name="ADCCON1" edc:nzwidth="32" edc:por="00000110000000000-00000--0000xxx" edc:portals="CLR SET INV" ltx:baseofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMABL" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:mask="0x1" edc:name="STRGLVL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:mask="0x7" edc:name="IRQVS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSPBCLKEN" edc:mask="0x1" edc:name="FSPBCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSSCLKEN" edc:mask="0x1" edc:name="FSSCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AICPMPEN" edc:mask="0x1" edc:name="AICPMPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:mask="0x1f" edc:name="STRGSRC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRACT" edc:mask="0x1" edc:name="FRACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBSLV" edc:mask="0x7" edc:name="TRBSLV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBMST" edc:mask="0x7" edc:name="TRBMST" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBERR" edc:mask="0x1" edc:name="TRBERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBEN" edc:mask="0x1" edc:name="TRBEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887010" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="rrrnnnnnnnnnnnnnnnnn-nnn-nnnnnnn" edc:cname="ADCCON2" edc:desc="" edc:impl="0xfffff77f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000-000-0000000" edc:name="ADCCON2" edc:nzwidth="32" edc:por="00000000000000000000-000-0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIOVR" edc:mask="0x1" edc:name="ADCEIOVR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:mask="0x1" edc:name="EOSIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:mask="0x1" edc:name="REFFLTIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:mask="0x1" edc:name="BGVRIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="10"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:mask="0x1" edc:name="EOSRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:mask="0x1" edc:name="REFFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:mask="0x1" edc:name="BGVRRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887020" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="nnnnnnnnr-rrrrrrnnnnnnnnnnnnnnnn" edc:cname="ADCCON3" edc:desc="" edc:impl="0xffbfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-0000000000000000000000" edc:name="ADCCON3" edc:nzwidth="32" edc:por="000000000-0000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:mask="0x3f" edc:name="ADINSEL" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:mask="0x1" edc:name="GSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:mask="0x1" edc:name="GLSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:mask="0x1" edc:name="RQCNVRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMP" edc:mask="0x1" edc:name="SAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:mask="0x1" edc:name="UPDRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:mask="0x1" edc:name="UPDIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:mask="0x1" edc:name="TRGSUSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:mask="0x7" edc:name="VREFSEL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DIGEN0" edc:mask="0x1" edc:name="DIGEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN1" edc:mask="0x1" edc:name="DIGEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN2" edc:mask="0x1" edc:name="DIGEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN3" edc:mask="0x1" edc:name="DIGEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN4" edc:mask="0x1" edc:name="DIGEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN5" edc:mask="0x1" edc:name="DIGEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:mask="0x1" edc:name="DIGEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:mask="0x3f" edc:name="CONCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:mask="0x3" edc:name="ADCSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887030" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnn--nnnnnn--nnnnnn" edc:cname="ADCTRGMODE" edc:desc="" edc:impl="0xfff3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000--000000--000000" edc:name="ADCTRGMODE" edc:nzwidth="32" edc:por="----000000000000--000000--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSAMPEN0" edc:mask="0x1" edc:name="SSAMPEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN1" edc:mask="0x1" edc:name="SSAMPEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN2" edc:mask="0x1" edc:name="SSAMPEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN3" edc:mask="0x1" edc:name="SSAMPEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN4" edc:mask="0x1" edc:name="SSAMPEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN5" edc:mask="0x1" edc:name="SSAMPEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="STRGEN0" edc:mask="0x1" edc:name="STRGEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN1" edc:mask="0x1" edc:name="STRGEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN2" edc:mask="0x1" edc:name="STRGEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN3" edc:mask="0x1" edc:name="STRGEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN4" edc:mask="0x1" edc:name="STRGEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN5" edc:mask="0x1" edc:name="STRGEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SH0ALT" edc:mask="0x3" edc:name="SH0ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH1ALT" edc:mask="0x3" edc:name="SH1ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH2ALT" edc:mask="0x3" edc:name="SH2ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH3ALT" edc:mask="0x3" edc:name="SH3ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH4ALT" edc:mask="0x3" edc:name="SH4ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH5ALT" edc:mask="0x3" edc:name="SH5ALT" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887040" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCIMCON1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN0" edc:mask="0x1" edc:name="SIGN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:mask="0x1" edc:name="DIFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN1" edc:mask="0x1" edc:name="SIGN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:mask="0x1" edc:name="DIFF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN2" edc:mask="0x1" edc:name="SIGN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:mask="0x1" edc:name="DIFF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN3" edc:mask="0x1" edc:name="SIGN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:mask="0x1" edc:name="DIFF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN4" edc:mask="0x1" edc:name="SIGN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:mask="0x1" edc:name="DIFF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN5" edc:mask="0x1" edc:name="SIGN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:mask="0x1" edc:name="DIFF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN6" edc:mask="0x1" edc:name="SIGN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:mask="0x1" edc:name="DIFF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN7" edc:mask="0x1" edc:name="SIGN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:mask="0x1" edc:name="DIFF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN8" edc:mask="0x1" edc:name="SIGN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:mask="0x1" edc:name="DIFF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN9" edc:mask="0x1" edc:name="SIGN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:mask="0x1" edc:name="DIFF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN10" edc:mask="0x1" edc:name="SIGN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:mask="0x1" edc:name="DIFF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN11" edc:mask="0x1" edc:name="SIGN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:mask="0x1" edc:name="DIFF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN12" edc:mask="0x1" edc:name="SIGN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF12" edc:mask="0x1" edc:name="DIFF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN13" edc:mask="0x1" edc:name="SIGN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF13" edc:mask="0x1" edc:name="DIFF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN14" edc:mask="0x1" edc:name="SIGN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF14" edc:mask="0x1" edc:name="DIFF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN15" edc:mask="0x1" edc:name="SIGN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF15" edc:mask="0x1" edc:name="DIFF15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887050" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="--------000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN18" edc:mask="0x1" edc:name="SIGN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF18" edc:mask="0x1" edc:name="DIFF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN19" edc:mask="0x1" edc:name="SIGN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF19" edc:mask="0x1" edc:name="DIFF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN20" edc:mask="0x1" edc:name="SIGN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF20" edc:mask="0x1" edc:name="DIFF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN21" edc:mask="0x1" edc:name="SIGN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF21" edc:mask="0x1" edc:name="DIFF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN22" edc:mask="0x1" edc:name="SIGN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF22" edc:mask="0x1" edc:name="DIFF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN23" edc:mask="0x1" edc:name="SIGN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF23" edc:mask="0x1" edc:name="DIFF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN24" edc:mask="0x1" edc:name="SIGN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF24" edc:mask="0x1" edc:name="DIFF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN25" edc:mask="0x1" edc:name="SIGN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF25" edc:mask="0x1" edc:name="DIFF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN26" edc:mask="0x1" edc:name="SIGN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF26" edc:mask="0x1" edc:name="DIFF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN27" edc:mask="0x1" edc:name="SIGN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF27" edc:mask="0x1" edc:name="DIFF27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887060" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="nnnnnn------nnnnnnnnnnnnnnnnnn--" edc:cname="ADCIMCON3" edc:desc="" edc:impl="0xfc0ffffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000------000000000000000000--" edc:name="ADCIMCON3" edc:nzwidth="32" edc:por="000000------000000000000000000--" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SIGN33" edc:mask="0x1" edc:name="SIGN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF33" edc:mask="0x1" edc:name="DIFF33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN34" edc:mask="0x1" edc:name="SIGN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF34" edc:mask="0x1" edc:name="DIFF34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN35" edc:mask="0x1" edc:name="SIGN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF35" edc:mask="0x1" edc:name="DIFF35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN36" edc:mask="0x1" edc:name="SIGN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF36" edc:mask="0x1" edc:name="DIFF36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN37" edc:mask="0x1" edc:name="SIGN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF37" edc:mask="0x1" edc:name="DIFF37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN38" edc:mask="0x1" edc:name="SIGN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF38" edc:mask="0x1" edc:name="DIFF38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN39" edc:mask="0x1" edc:name="SIGN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF39" edc:mask="0x1" edc:name="DIFF39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN40" edc:mask="0x1" edc:name="SIGN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF40" edc:mask="0x1" edc:name="DIFF40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN41" edc:mask="0x1" edc:name="SIGN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF41" edc:mask="0x1" edc:name="DIFF41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SIGN45" edc:mask="0x1" edc:name="SIGN45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF45" edc:mask="0x1" edc:name="DIFF45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN46" edc:mask="0x1" edc:name="SIGN46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF46" edc:mask="0x1" edc:name="DIFF46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN47" edc:mask="0x1" edc:name="SIGN47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF47" edc:mask="0x1" edc:name="DIFF47" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887070" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="ADCIMCON4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="ADCIMCON4" edc:nzwidth="32" edc:por="----------------------------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN48" edc:mask="0x1" edc:name="SIGN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF48" edc:mask="0x1" edc:name="DIFF48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN49" edc:mask="0x1" edc:name="SIGN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF49" edc:mask="0x1" edc:name="DIFF49" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
